package com.mygdx.magegame.mechanics.magic;

public class MagicOnCollisionFunctions {
    // Функции предназначенные для onCollision должны принимать 3 параметра:
    // GameObject - тот объект, в который попало заклинание
    // String - строка параметров для функции
    // boolean - флаг проверки строки параметров на правильность

    // Если флаг выставлен в true, то при вызове функции будет выполнено не основное действие, а проверка на наличие всех
    // необходимых параметров в строке параметров. Функция вернёт true - если проверка пройдена, false - если нет.
    // При обычном выполнении функция не должна возвращать никакое полезное значение. (Она будет возвращать true, однако
    // при любом исходе выполнения.)
}
